Revit 2027 API
BalusterInfo.BaseReferenceName Property
 Represents the name of the reference for the bottom of this baluster or post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string BaseReferenceName { get; set; }
Public Property BaseReferenceName As String
	Get
	Set
public:
property String^ BaseReferenceName {
	String^ get ();
	void set (String^ value);
}
member BaseReferenceName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The name doesn't refer to a valid reference.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Two pre-defined reference names can be obtained using [!:Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForHost()] or [!:Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForTopRail()]. The rest of valid reference names that are allowed to be used in the setter for BaseReferenceName are the actual names of non-continuous rails [!:Autodesk::Revit::DB::Architecture::NonContinuousRailInfo::Name] in [!:Autodesk::Revit::DB::Architecture::NonContinuousRailStructure]
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace